{"majorDevelopment":[{"symbol":"AAPL","datetime":"2020-05-07 11:30:38","headline":"Apple Awards $10 Mln From Advanced Manufacturing Fund To COPAN Diagnostics","description":"APPLE AWARDS $10 MILLION FROM ADVANCED MANUFACTURING FUND TO COPAN DIAGNOSTICS.SOURCING EQUIPMENT AND MATERIALS FOR COPAN DIAGNOSTICS FROM COMPANIES ACROSS U.S..APPLE IS ON TRACK TO REACH ITS COMMITMENT OF CONTRIBUTING $350 BILLION TO U.S. ECONOMY OVER A FIVE YEAR PERIOD.APPLE WILL SUPPORT COPAN DIAGNOSTICS' EXPANSION TO A NEW, LARGER FACILITY IN SOUTHERN CALIFORNIA.HAS DONATED TENS OF MILLIONS OF DOLLARS TOWARD GLOBAL COVID-19 RESPONSE, INCLUDING GLOBAL CITIZEN AND AMERICA'S FOOD FUND."},{"symbol":"AAPL","datetime":"2020-05-02 12:48:56","headline":"Berkshire Hathaway Says It Ended Q1 With $137.3 Bln Cash And Equivalents","description":"IN THE FIRST THREE MONTHS OF 2020, BERKSHIRE PAID $1.7 BILLION TO REPURCHASE SHARES OF CLASS A AND B COMMON STOCK.BERKSHIRE HATHAWAY INC SAYS IT ENDED Q1 WITH $137.3 BILLION CASH AND EQUIVALENTS.BERKSHIRE OWNED $63.8 BILLION APPLE SHARES AS OF MARCH 31, COMPARED WITH REPORTED $73.7 BILLION AS OF DEC 31.BERKSHIRE OWNED $20.2 BILLION BANK OF AMERICA SHARES AS OF MARCH 31, COMPARED WITH REPORTED $33.4 BILLION AS OF DEC 31.BERKSHIRE OWNED $9.9 BILLION WELLS FARGO SHARES AS OF MARCH 31, COMPARED WITH REPORTED $18.6 BILLION AS OF DEC 31.BERKSHIRE OWNED $17.7 BLN COCA-COLA CO SHARES AS OF MARCH 31, COMPARED WITH REPORTED $22.1 BILLION AS OF DEC 31.MOST OF CO'S BUSINESSES NEGATIVELY AFFECTED IN SECOND HALF OF MARCH AND THROUGH APRIL DUE TO CORONAVIRUS.CANNOT RELIABLY PREDICT WHEN BUSINESS ACTIVITIES AT CO'S NUMEROUS AND DIVERSE OPERATIONS WILL NORMALIZE.TOOK STEPS INCLUDING EMPLOYEE FURLOUGHS, CAPITAL SPENDING REDUCTIONS IN RESPONSE TO ECONOMIC LOSSES FROM REDUCTIONS IN CONSUMER DEMAND."},{"symbol":"AAPL","datetime":"2020-04-30 20:40:45","headline":"Apple Reports Q2 Earnings Of $2.55 Per Share","description":"QUARTERLY EARNINGS PER SHARE $2.55.QUARTERLY REVENUE $58.3 BILLION, UP 1%.Q2 EARNINGS PER SHARE VIEW $2.26, REVENUE VIEW $54.54 BILLION -- REFINITIV IBES DATA.INTERNATIONAL SALES ACCOUNTED FOR 62% OF THE QUARTER'S REVENUE.SAYS BOARD AUTHORIZED INCREASE OF $50 BILLION TO EXISTING SHARE REPURCHASE PROGRAM.SAYS BOARD DECLARED A CASH DIVIDEND OF $0.82 PER SHARE OF STOCK, UP 6%.QUARTERLY GREATER CHINA REVENUE $9.46 BILLION VERSUS $10.22 BILLION.QUARTERLY IPAD REVENUE $4.37 BILLION VERSUS $4.87 BILLION.QUARTERLY IPHONE REVENUE $28.96 BILLION VERSUS $31.05 BILLION.QUARTERLY MAC REVENUE $5.35 BILLION VERSUS $5.51 BILLION.QUARTERLY SERVICES REVENUE $13.35 BILLION VERSUS $11.45 BILLION.GENERATED OPERATING CASH FLOW OF $13.3 BILLION DURING QUARTER, UP $2.2 BILLION.QUARTERLY WEARABLES, HOME AND ACCESSORIES REVENUE $6.28 BILLION VERSUS $5.13 BILLION.QUARTERLY GROSS MARGIN $22.37 BILLION VERSUS $21.82 BILLION."},{"symbol":"AAPL","datetime":"2020-04-27 11:01:06","headline":"Apple Delays Mass Production Of 2020 Flagship iPhones - WSJ","description":"APPLE DELAYS MASS PRODUCTION OF 2020 FLAGSHIP IPHONES - WSJ.APPLE IS FORGING AHEAD WITH PLANS TO RELEASE FOUR NEW IPHONE MODELS LATER THIS YEAR - WSJ, CITING SOURCES.APPLE'S NEW PHONES, SOME WITH 5G CONNECTIVITY, WILL VARY IN PRICE AND COME IN THREE SIZES - WSJ.APPLE IS SLASHING THE NUMBER OF HANDSETS THAT IT PLANS TO MAKE IN THE SECOND HALF OF THIS YEAR BY AS MUCH AS 20% - WSJ."},{"symbol":"AAPL","datetime":"2020-04-21 12:42:55","headline":"Apple Plans To Increase IPhone Output By 4% Through March 2021 - Nikkei","description":":APPLE NOTIFIED SEVERAL OF ITS SUPPLIERS THAT IT PLANS TO MAKE ABOUT 213 MILLION IPHONES IN 12 MONTHS THROUGH MARCH 2021, UP 4% FROM SAME PERIOD YEAR AGO"},{"symbol":"AAPL","datetime":"2020-04-15 14:08:49","headline":"Goldman Sachs Says Activated Global Business Continuity Plan, With About 98% Of Global Employees Working Remotely","description":"GOLDMAN SACHS - ACTIVATED GLOBAL BUSINESS CONTINUITY PLAN, WITH ABOUT 98% OF GLOBAL EMPLOYEES WORKING REMOTELY.GOLDMAN SACHS - INTRODUCED TELEMEDICINE BENEFIT TO EMPLOYEES AND COVERED DEPENDENTS; WAIVING ALL COSTS FOR 2020.GOLDMAN SACHS - COVID-19 ASSISTANCE PROGRAM, GIVES FLEXIBILITY TO DEFER MARCUS LOAN OR APPLE CARD PAYMENT FOR UP TO 2 MONTHS AT NO COST TO CUSTOMERS.GOLDMAN SACHS - COVID-19 ASSISTANCE PROGRAM, ALSO GIVES FLEXIBILITY TO ACCESS FUNDS IN MARCUS CDS EARLY WITH NO PENALTY.GOLDMAN SACHS - BOOKRUNNER ON $200 PLUS BILLION OF TOTAL INVESTMENT GRADE ISSUANCE IN Q1."},{"symbol":"AAPL","datetime":"2020-04-14 16:44:48","headline":"Apple Releases Mobility Data Trends Tool From Apple Maps To Help Mitigate Covid-19 Spread","description":"Apple Inc: :APPLE MAKES MOBILITY DATA AVAILABLE TO AID COVID"},{"symbol":"AAPL","datetime":"2020-04-13 20:09:30","headline":"IDC Says Traditional PC Shipments Saw Sharp Decline In Q1","description":":IDC SAYS TRADITIONAL PC SHIPMENTS SAW SHARP DECLINE IN Q1 DESPITE INCREASED DEMAND TO MEET REMOTE WORK AND SCHOOL NEEDS.IDC SAYS TRADITIONAL PC SHIPMENTS DECLINE IN Q1 WAS RESULT OF REDUCED SUPPLY DUE TO OUTBREAK OF COVID"},{"symbol":"AAPL","datetime":"2020-03-25 20:09:29","headline":"Apple Weighs Delaying Launch Of 5G iPhone By Months - Nikkei, Citing Sources","description":"APPLE INC WEIGHS DELAYING LAUNCH OF 5G IPHONE BY MONTHS - NIKKEI, CITING SOURCES.APPLE WILL MAKE A FINAL DECISION ON ITS 5G IPHONE LAUNCH AROUND MAY AT THE LATEST - NIKKEI, CITING SOURCE."},{"symbol":"AAPL","datetime":"2020-03-19 12:37:25","headline":"STMicro: agreement signed with unions to cut production on French sites til April 2","description":":STMICRO SAYS AGREEMENT SIGNED WITH UNIONS TO CUT PRODUCTION ON FRENCH SITES RUNS UNTIL APRIL 2."},{"symbol":"AAPL","datetime":"2020-03-18 12:27:15","headline":"Apple Unveils New iPad Pro With Breakthrough LiDAR Scanner And Brings Trackpad Support To IPadOS","description":"APPLE UNVEILS NEW IPAD PRO WITH BREAKTHROUGH LIDAR SCANNER AND BRINGS TRACKPAD SUPPORT TO IPADOS.APPLE INC - NEW IPAD PRO IS AVAILABLE TO ORDER STARTING WEDNESDAY ON APPLE.COM..APPLE INC - IPAD PRO WILL BE AVAILABLE IN STORES STARTING NEXT WEEK..APPLE INC - 11-INCH IPAD PRO STARTS AT $799 (US) FOR WI-FI MODEL AND $949 (US) FOR WI-FI + CELLULAR MODEL.APPLE INC - 12.9-INCH IPAD PRO STARTS AT $999 (US) FOR WI-FI MODEL AND $1,149 (US) FOR WI-FI + CELLULAR MODEL FROM APPLE.COM."},{"symbol":"AAPL","datetime":"2020-03-16 15:03:34","headline":"Ingram Micro Says It Intends To Contest French Competition Authority Decision","description":"INGRAM MICRO - INGRAM MICRO FRANCE INFORMED ABOUT DECISION OF FRENCH COMPETITION AUTHORITY IN CASE AGAINST APPLE, INGRAM MICRO \u0026 TECH DATA.INGRAM MICRO - INGRAM MICRO FINANCE INTENDS TO CONTEST DECISION TO FRENCH JUDICIARY.INGRAM MICRO - INGRAM MICRO FRANCE HAS CALLED FOR EXTRAORDINARY WORKS COUNCIL MEETING TO DISCUSS IMPACT OF FRENCH COMPETITION AUTHORITY DECISION."},{"symbol":"AAPL","datetime":"2020-03-13 16:13:42","headline":"Apple Says Worldwide Developers Conference 2020 Kicks Off In June With An All-New Online Format","description":"APPLE'S WORLDWIDE DEVELOPERS CONFERENCE 2020 KICKS OFF IN JUNE WITH AN ALL-NEW ONLINE FORMAT.APPLE - WILL COMMIT $1 MILLION TO LOCAL SAN JOSE ORGANIZATIONS TO OFFSET ASSOCIATED REVENUE LOSS AS A RESULT OF WWDC 2020'S NEW ONLINE FORMAT.APPLE INC - CURRENT HEALTH SITUATION HAS REQUIRED THAT WE CREATE A NEW WWDC 2020 FORMAT."},{"symbol":"AAPL","datetime":"2020-02-26 14:36:35","headline":"Altice USA Announces Launch Of Altice One On Apple TV","description":"ALTICE USA- ANNOUNCES LAUNCH OF ALTICE ONE ON APPLE TV."},{"symbol":"AAPL","datetime":"2020-02-26 03:05:19","headline":"eBay Says To Begin Managing Payments In UK","description":"EBAY WILL BEGIN MANAGING PAYMENTS IN THE UNITED KINGDOM.EBAY INC- EBAY PLANS TO OFFER BUYERS IN U.K. A VARIETY OF PAYMENT OPTIONS, INCLUDING CREDIT CARD, GOOGLE PAY AND PAYPAL.EBAY INC- EBAY PLANS TO OFFER BUYERS IN U.K. A PAYMENT OPTIONS, INCLUDING APPLE PAY, AVAILABLE ON IPHONE AND IPAD.EBAY INC- EXPECTS TO HAVE TRANSITIONED A MAJORITY OF ITS U.K. BUSINESS SELLERS BY END OF 2020 AND A MAJORITY OF ITS MARKETPLACE CUSTOMERS IN 2021."},{"symbol":"AAPL","datetime":"2020-02-25 15:12:48","headline":"Johnson \u0026 Johnson launches Heartline","description":"JOHNSON \u0026 JOHNSON LAUNCHES HEARTLINE, THE FIRST-OF-ITS-KIND, VIRTUAL STUDY DESIGNED TO EXPLORE IF A NEW IPHONE APP AND APPLE WATCH CAN HELP REDUCE THE RISK OF STROKE.JOHNSON \u0026 JOHNSON SAYS IN COLLABORATION WITH APPLE, IS OFFERING ELIGIBLE U.S. ADULTS 65 YEARS AND OLDER THE OPPORTUNITY TO JOIN THE CLINICAL STUDY BY DOWNLOADING THE HEARTLINE STUDY APP ON IPHONE.JOHNSON \u0026 JOHNSON SAYS JANSSEN PHARMACEUTICAL COMPANIES OF JOHNSON \u0026 JOHNSON, IN COLLABORATION WITH APPLE, OPENED ENROLLMENT FOR THE HEARTLINE STUDY."},{"symbol":"AAPL","datetime":"2020-02-24 20:59:28","headline":"Virnetx Says U.S. Supreme Court Denied Apple's Petition For Seeking Review Of Judgment Of U.S. Court Of Appeals For Federal Circuit In Case 2018-1197","description":"VIRNETX - U.S. SUPREME COURT DENIED APPLE'S PETITION FOR SEEKING REVIEW OF JUDGMENT OF U.S. COURT OF APPEALS FOR FEDERAL CIRCUIT IN CASE 2018-1197.VIRNETX HOLDING - UNDERLYING JUDGMENT IN CASE AWARDED CO A TOTAL OF $439.8 MILLION IN DAMAGES, FEES, \u0026 INTEREST."},{"symbol":"AAPL","datetime":"2020-02-22 13:23:02","headline":"Berkshire Hathaway Says Investment In Apple Totaled $73.7 Bln As Of Dec 31","description":"INVESTMENT IN APPLE INC TOTALED $73.7 BILLION AS OF DEC 31, 2019.INVESTMENT IN BANK OF AMERICA CORP TOTALED $33.4 BILLION AS OF DEC 31, 2019."},{"symbol":"AAPL","datetime":"2020-02-17 21:29:21","headline":"Apple Says Does Not Expect To Meet Revenue Guidance Provided For March Quarter","description":"INVESTOR UPDATE ON QUARTERLY GUIDANCE.APPLE INC - DO NOT EXPECT TO MEET REVENUE GUIDANCE PROVIDED FOR MARCH QUARTER DUE TO TWO MAIN FACTORS.APPLE INC - WORK IS STARTING TO RESUME AROUND CHINA , BUT WE ARE EXPERIENCING A SLOWER RETURN TO NORMAL CONDITIONS THAN WE HAD ANTICIPATED.APPLE INC - IPHONE MANUFACTURING PARTNER SITES LOCATED OUTSIDE HUBEI ARE RAMPING UP MORE SLOWLY THAN HAD ANTICIPATED.APPLE INC - WORLDWIDE IPHONE SUPPLY WILL BE TEMPORARILY CONSTRAINED.APPLE INC - IPHONE SUPPLY SHORTAGES WILL TEMPORARILY AFFECT REVENUES WORLDWIDE.APPLE INC - DEMAND FOR PRODUCTS WITHIN CHINA HAS BEEN AFFECTED.APPLE INC - CORPORATE OFFICES AND CONTACT CENTERS IN CHINA ARE OPEN, AND OUR ONLINE STORES HAVE REMAINED OPEN THROUGHOUT.APPLE INC - OUTSIDE OF CHINA, CUSTOMER DEMAND ACROSS PRODUCT AND SERVICE CATEGORIES HAS BEEN STRONG TO DATE AND IN LINE WITH EXPECTATIONS."},{"symbol":"AAPL","datetime":"2020-02-17 00:00:00","headline":"Apple Says Does Not Expect To Meet Revenue Guidance Provided For March Quarter","description":"Feb 17  - Apple Inc \u003cAAPL.O\u003e::INVESTOR UPDATE ON QUARTERLY GUIDANCE.APPLE INC - DO NOT EXPECT TO MEET REVENUE GUIDANCE PROVIDED FOR MARCH QUARTER DUE TO TWO MAIN FACTORS.APPLE INC - WORK IS STARTING TO RESUME AROUND CHINA , BUT WE ARE EXPERIENCING A SLOWER RETURN TO NORMAL CONDITIONS THAN WE HAD ANTICIPATED.APPLE INC - IPHONE MANUFACTURING PARTNER SITES LOCATED OUTSIDE HUBEI ARE RAMPING UP MORE SLOWLY THAN HAD ANTICIPATED.APPLE INC - WORLDWIDE IPHONE SUPPLY WILL BE TEMPORARILY CONSTRAINED.APPLE INC - IPHONE SUPPLY SHORTAGES WILL TEMPORARILY AFFECT REVENUES WORLDWIDE.APPLE INC - DEMAND FOR PRODUCTS WITHIN CHINA HAS BEEN AFFECTED.APPLE INC - CORPORATE OFFICES AND CONTACT CENTERS IN CHINA ARE OPEN, AND OUR ONLINE STORES HAVE REMAINED OPEN THROUGHOUT.APPLE INC - OUTSIDE OF CHINA, CUSTOMER DEMAND ACROSS PRODUCT AND SERVICE CATEGORIES HAS BEEN STRONG TO DATE AND IN LINE WITH EXPECTATIONS."}],"symbol":"AAPL"}